Ran Plan for dir: `terraform/applications/noteburst` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.org.data.sentry_organization.org: Reading...
module.org.data.sentry_organization.org: Read complete after 0s [id=rubin-observatory]
module.org.data.sentry_team.square: Reading...
module.new_unresolved_alert["idfint"].data.sentry_organization_integration.slack: Reading...
module.new_unresolved_alert["idfdev"].data.sentry_organization_integration.slack: Reading...
module.new_unresolved_alert["usdfdev"].data.sentry_organization_integration.slack: Reading...
module.new_unresolved_alert["usdfint"].data.sentry_organization_integration.slack: Reading...
module.new_unresolved_alert["idfprod"].data.sentry_organization_integration.slack: Reading...
module.new_unresolved_alert["usdfprod"].data.sentry_organization_integration.slack: Reading...
module.new_unresolved_alert["idfdev"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.new_unresolved_alert["idfprod"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.new_unresolved_alert["idfint"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.new_unresolved_alert["usdfint"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.new_unresolved_alert["usdfprod"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.new_unresolved_alert["usdfdev"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.org.data.sentry_team.square: Read complete after 1s [id=square]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # sentry_project.project will be created
+ resource "sentry_project" "project" {
      + client_security       = (known after apply)
      + default_rules         = false
      + digests_max_delay     = (known after apply)
      + digests_min_delay     = (known after apply)
      + features              = (known after apply)
      + filters               = (known after apply)
      + fingerprinting_rules  = (known after apply)
      + grouping_enhancements = (known after apply)
      + id                    = (known after apply)
      + internal_id           = (known after apply)
      + name                  = "Noteburst"
      + organization          = "rubin-observatory"
      + platform              = "python"
      + resolve_age           = (known after apply)
      + slug                  = (known after apply)
      + teams                 = [
          + "square",
        ]
    }

  # module.new_unresolved_alert["idfdev"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-dev-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "idfdev"
      + filter_match  = "any"
      + frequency     = 5
      + id            = (known after apply)
      + name          = "New and Unresolved - idfdev"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.new_unresolved_alert["idfint"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-int-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "idfint"
      + filter_match  = "any"
      + frequency     = 5
      + id            = (known after apply)
      + name          = "New and Unresolved - idfint"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.new_unresolved_alert["idfprod"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "idfprod"
      + filter_match  = "any"
      + frequency     = 5
      + id            = (known after apply)
      + name          = "New and Unresolved - idfprod"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.new_unresolved_alert["usdfdev"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-dev"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "usdfdev"
      + filter_match  = "any"
      + frequency     = 5
      + id            = (known after apply)
      + name          = "New and Unresolved - usdfdev"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.new_unresolved_alert["usdfint"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-int"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "usdfint"
      + filter_match  = "any"
      + frequency     = 5
      + id            = (known after apply)
      + name          = "New and Unresolved - usdfint"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.new_unresolved_alert["usdfprod"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "usdfprod"
      + filter_match  = "any"
      + frequency     = 5
      + id            = (known after apply)
      + name          = "New and Unresolved - usdfprod"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.new_unresolved_alert["idfdev"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id     = (known after apply)
      + input  = "idfdev"
      + output = (known after apply)
    }

  # module.new_unresolved_alert["idfint"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id     = (known after apply)
      + input  = "idfint"
      + output = (known after apply)
    }

  # module.new_unresolved_alert["idfprod"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id     = (known after apply)
      + input  = "idfprod"
      + output = (known after apply)
    }

  # module.new_unresolved_alert["usdfdev"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id     = (known after apply)
      + input  = "usdfdev"
      + output = (known after apply)
    }

  # module.new_unresolved_alert["usdfint"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id     = (known after apply)
      + input  = "usdfint"
      + output = (known after apply)
    }

  # module.new_unresolved_alert["usdfprod"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id     = (known after apply)
      + input  = "usdfprod"
      + output = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/applications/noteburst
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://roundtable-dev.lsst.cloud/atlantis/lock?id=lsst-sqre%252Fprodromos%252Fterraform%252Fapplications%252Fnoteburst%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/applications/noteburst
  ```
Plan: 13 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```